# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8n-CBAM model configuration file

# Parameters
nc: 12  # number of classes - 必须和data.yaml一致
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple

# Anchors
# (YOLOv8不需要预定义anchors)

# YOLOv8.0n backbone
backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2.  Actual out: 64 * 0.25 = 16
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4.  Actual out: 128 * 0.25 = 32
  - [-1, 3, C2f, [128, True]]   # Actual out: 32
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8.  Actual out: 256 * 0.25 = 64
  - [-1, 6, C2f, [256, True]]   # Actual out: 64
  - [-1, 1, CBAM, [64]]          # <-- *** 修改这里: 256 -> 64 ***
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16. Actual out: 512 * 0.25 = 128
  - [-1, 6, C2f, [512, True]]   # Actual out: 128
  - [-1, 1, CBAM, [128]]         # <-- *** 修改这里: 512 -> 128 ***
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32. Actual out: 1024 * 0.25 = 256
  - [-1, 3, C2f, [1024, True]]  # Actual out: 256
  - [-1, 1, SPPF, [1024, 5]]   # Actual out: 256

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 8], 1, Concat, [1]]  # cat backbone P4 (layer 8). concat 256 + 128 = 384
  - [-1, 3, C2f, [512]]  # Actual out: 128

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P3 (layer 5). concat 128 + 64 = 192
  - [-1, 3, C2f, [256]]  # Actual out: 64
  - [-1, 1, CBAM, [64]]         # <-- *** 修改这里: 256 -> 64 ***

  - [-1, 1, Conv, [256, 3, 2]] # Actual out: 64
  - [[-1, 12], 1, Concat, [1]]  # cat head P4 (layer 12). concat 64 + 128 = 192
  - [-1, 3, C2f, [512]]  # Actual out: 128

  - [-1, 1, Conv, [512, 3, 2]] # Actual out: 128
  - [[-1, 9], 1, Concat, [1]]  # cat head P5 (layer 9). concat 128 + 256 = 384
  - [-1, 3, C2f, [1024]] # Actual out: 256

  - [[16, 19, 22], 1, Detect, [nc]]  # Detect(P3, P4, P5)